app/controllers/listings_controller.rb

SELECT "listings".* FROM "listings" WHERE (user_id = 1)
---
  def index
    @listings = Listing.all

INSERT INTO "listings" ("name", "description", "price", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Frye Boots"], ["description", "Brown Leather and Size 9"], ["price", "120.0"], ["created_at", "2017-09-30 14:09:30.804960"], ["updated_at", "2017-09-30 14:09:30.804960"], ["user_id", 1]]
---
  def create
    @listing = Listing.new(listing_params)
    # @listing = current_user.listings.build(listing_params)

    if @listing.save

UPDATE "listings" SET "name" = $1, "description" = $2, "price" = $3, "imagelink" = $4, "updated_at" = $5 WHERE "listings"."id" = $6  [["name", "Bag update last"], ["description", "new update"], ["price", "200.0"], ["imagelink", "https://i.imgur.com/qiuxJlj.jpg"], ["updated_at", "2017-10-03 14:15:09.267896"], ["id", 16]]
---
  def update
    if @listing.update(listing_params)

SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "listings" WHERE "listings"."id" = $1  [["id", 1]]
---
  def destroy
    @listing = Listing.find(params[:id])
    @listing.destroy

SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_listing
      @listing = Listing.where('user_id = ?', current_user.id)